#------------------------------------------var_1--------------------------------
n = int(input("Write any number: "))
while n < 0:
    print("No, I need целое положительное число")
    n = int(input("Введите целое положительное число: "))
n_2 = int(f"{n}{n}")
n_3 = int(f"{n}{n}{n}")
print(f"{n + n_2 + n_3}")

#------------------------------------------var_2--------------------------------
i = input("Write a number: ")
while i < "0":
    print("No, I need целое положительное число")
    i = input("Введите целое положительное число: ")
print(f"{i} + {i + i} + {i + i + i} = {int(i) + int(i + i) + int(i + i + i)}")

