winter = [12, 1, 2]
spring = [3, 4, 5]
summer = [6, 7, 8]
autumn = [9, 10, 11]
m = int(input("Введите номер любого месяца, ну пожалуйста: "))
while m < 1 or m > 12:
    print("Нет такого месяца! Попробуйте ещё раз")
    m = int(input("Введите номер любого месяца, ну пожалуйста: "))
if m in winter:
    print("Это зима!")
elif m in spring:
    print("Это весна!")
elif m in summer:
    print("Это лето!")
else:
    print("Это осень!")

#-----------------------------var_2---------------------------------

months = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима"}
m_2 = int(input("Давай ещё раз попробуем? Введи номер любого месяца: "))
while m_2 < 1 or m_2 > 12:
    print("Нет такого месяца! Попробуй ещё раз")
    m_2 = int(input("Введи номер любого месяца: "))
print(f"Я знаю! Это {months.get(m_2)}!")



